Documents/ЛБ_УстановкаНастроекЗаймаВерхнегоУровня.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_УстановкаНастроекЗаймаВерхнегоУровня</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_НастройкиЗаймаВерхнегоУровня</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислятьПроцентыЗаДеньЗалога</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеНачислятьПроцентыЗаПоследнийДень</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьСуммуПроценты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОкругленияПроценты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьВБольшуюСторонуПроценты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОкругленияСуммыПроцентов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОкругленияСуммыПроцентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьСуммуОценка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОкругленияОценка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьВБольшуюСторонуОценка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчитатьПроцентыДеньВыдачиРавенДеньВыкупа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ПорядкиОкругления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПорядкиОкругления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Окр0_01</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_05</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр0_5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр50</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр100</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_УстановкаНастроекЗаймаВерхнегоУровня/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();
		Объект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить(); 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОкруглятьСуммуПроцентыПриИзменении(Элемент)
	Если НЕ Объект.ОкруглятьСуммуПроценты Тогда
		Объект.ОкруглятьВБольшуюСторонуПроценты = Ложь;
		Объект.ПорядокОкругленияПроценты        = ПредопределенноеЗначение("Перечисление.ПорядкиОкругления.Окр0_01"); 
		Объект.ВидОкругленияСуммыПроцентов = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОкругленияСуммыПроцентов.ПустаяСсылка");
	КонецЕсли;
	
	Элементы.ГруппаОкругленияПроценты.Доступность = Объект.ОкруглятьСуммуПроценты;

КонецПроцедуры

&НаКлиенте
Процедура ОкруглятьСуммуОценкаПриИзменении(Элемент)
	Если НЕ Объект.ОкруглятьСуммуОценка Тогда
		Объект.ОкруглятьВБольшуюСторонуОценка = Ложь;
		Объект.ПорядокОкругленияОценка        = ПредопределенноеЗначение("Перечисление.ПорядкиОкругления.Окр0_01"); 
	КонецЕсли;
	
	Элементы.ГруппаОценка.Доступность = Объект.ОкруглятьСуммуОценка;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ОкруглятьСуммуПроценты Тогда
		Если НЕ ЗначениеЗаполнено(ТекущийОбъект.ВидОкругленияСуммыПроцентов) Тогда  
			Сообщить("Необходимо выбрать вид округления процентов!"); 
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры
